---
kind: type
id: T:Autodesk.Revit.DB.FilterRule
source: html/a8f202ca-3c88-ecc4-fa93-549b26a412d7.htm
---
# Autodesk.Revit.DB.FilterRule

Defines a boolean operation that can be used to cull elements from a document.

## Syntax (C#)
```csharp
public class FilterRule : IDisposable
```